# Wprowadzenie do przetwarzania danych

## wprowadzenie do jupyter notebook

* komórki typu `markdown`
* komórki typy `code`
* skróty klawiaturow

esc - przejscie do trybu polecen

```
a - above dodanie u góry komórki
b - below dodanie u dołu
m - zmiana markdown
y - zmiana na code
```
enter - przejscie do trybu edycji

```
shift + Enter - wykonanie komórki i przejście do kolejnej (lub tworzy nowa jak brak)
alt + Enter - wykona i utworzy nowa i przejdzie do niej
ctrl + Enter - wykona i pozostanie w danej komórce
```

In [14]:
# !dir
!pip install pandas

Collecting pandas
  Downloading pandas-2.2.2-cp312-cp312-win_amd64.whl.metadata (19 kB)
Collecting numpy>=1.26.0 (from pandas)
  Downloading numpy-1.26.4-cp312-cp312-win_amd64.whl.metadata (61 kB)
     ---------------------------------------- 0.0/61.0 kB ? eta -:--:--
     ------ --------------------------------- 10.2/61.0 kB ? eta -:--:--
     -------------------------------------- 61.0/61.0 kB 819.4 kB/s eta 0:00:00
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\kurs\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2024.1-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2024.1-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\kurs\appdata\local\programs\python\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pandas-2.2.2-cp312-cp312-win_amd64.whl (11.5 MB)
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
    --------------------------------------- 0.2/11.5 MB 4.1 MB/s eta 0:00:03
   -- ------------------------------------- 0.8/11.5 MB 8.1 MB/s eta 0:00:02
   ------- -------------------------------- 2.3/11.5 MB 16.0 MB/s eta 0:00:01
   --------------- ------------------------ 4.4/11.5 MB 23.5 MB/s eta 0:00:01
   ---------------------- ----------------- 6.6/11.5 MB 28.1 MB/s eta 0:00:01
   ----------------------------- ---------- 8.4/11.5 MB 29.8 MB/s eta 0:00:01
   ------------------------------------- -- 10.7/11.5 MB 40.9 MB/s eta 0:00:01
   ---------------------------------------  11.5/11.5 MB 46.7 MB/s eta 0:00:01
   ---------------------------------------- 11.5/11.5 MB 38.5 MB/s eta 0:00:00
Downloading numpy-1.26.4-cp312-cp312-win_amd64.whl (15.5 MB)
   ---------------------------------------- 0.0/15.5 MB ? eta -:--:--
   ---- ----------------------------------- 1.9/15.5 MB 59.5 MB/s eta 0:00:01
   -------- ------------------------------- 3.3/15.5 MB 35.5 MB/s eta 0:00:01
   ---------------- ----------------------- 6.2/15.5 MB 49.9 MB/s eta 0:00:01
   ------------------------ --------------- 9.7/15.5 MB 51.4 MB/s eta 0:00:01
   ----------------------------- ---------- 11.5/15.5 MB 50.4 MB/s eta 0:00:01
   ------------------------------------ --- 14.0/15.5 MB 54.4 MB/s eta 0:00:01
   ---------------------------------------  15.5/15.5 MB 50.4 MB/s eta 0:00:01
   ---------------------------------------  15.5/15.5 MB 50.4 MB/s eta 0:00:01
   ---------------------------------------- 15.5/15.5 MB 36.4 MB/s eta 0:00:00
Downloading pytz-2024.1-py2.py3-none-any.whl (505 kB)
   ---------------------------------------- 0.0/505.5 kB ? eta -:--:--
   --------------------------------------- 505.5/505.5 kB 31.0 MB/s eta 0:00:00
Downloading tzdata-2024.1-py2.py3-none-any.whl (345 kB)
   ---------------------------------------- 0.0/345.4 kB ? eta -:--:--
   --------------------------------------- 345.4/345.4 kB 10.8 MB/s eta 0:00:00
Installing collected packages: pytz, tzdata, numpy, pandas
Successfully installed numpy-1.26.4 pandas-2.2.2 pytz-2024.1 tzdata-2024.1

In [16]:
import pandas as pd

In [17]:
pd.__version__

'2.2.2'

In [18]:
pd.Series

pandas.core.series.Series

In [19]:
pd.DataFrame

pandas.core.frame.DataFrame

In [20]:
data = ["a", "b", "c", "d"]
series = pd.Series(data)

In [21]:
series

0    a
1    b
2    c
3    d
dtype: object

In [22]:
data = {"a": 1, "b": 2, "c": 3}
series = pd.Series(data)
series

a    1
b    2
c    3
dtype: int64

In [24]:
data = [
    {"name": "Ola", "age": 28, "city": "Warszawa"}, 
    {"name": "Łukasz", "age": 32, "city": "Warszawa"}, 
    {"name": "Kamil", "age": 27, "city": "Wrocław"}, 
    {"name": "Rafał", "age": 40, "city": "Warszawa"}, 
]

In [25]:
df = pd.DataFrame(data)

In [26]:
df

     name  age      city
0     Ola   28  Warszawa
1  Łukasz   32  Warszawa
2   Kamil   27   Wrocław
3   Rafał   40  Warszawa

In [29]:
data = {
    "name": ["Ola", "Łukasz"],
    "age": [28, 32],
    "city": ["Warszawa", "Olecko"]
}

In [30]:
df1 = pd.DataFrame(data)
df1

     name  age      city
0     Ola   28  Warszawa
1  Łukasz   32    Olecko

In [32]:
df.head(1)

  name  age      city
0  Ola   28  Warszawa

In [34]:
df.tail(1)

    name  age      city
3  Rafał   40  Warszawa

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     4 non-null      int64
 2   city    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [36]:
df.describe()

             age
count   4.000000
mean   31.750000
std     5.909033
min    27.000000
25%    27.750000
50%    30.000000
75%    34.000000
max    40.000000

In [40]:
df.to_csv("klasa.csv", index=False)

In [41]:
!dir

 Volume in drive C has no label.
 Volume Serial Number is 584F-CC44

 Directory of C:\Users\kurs\workspace

29.05.2024  11:51    <DIR>          .
29.05.2024  11:51    <DIR>          ..
29.05.2024  11:26    <DIR>          .idea
29.05.2024  11:38    <DIR>          .ipynb_checkpoints
29.05.2024  09:38               351 argparse_example.py
29.05.2024  10:27    <DIR>          dane
28.05.2024  16:30               101 dane.json
28.05.2024  15:40                75 data.txt
28.05.2024  10:45               448 formatowanie_napisow.py
28.05.2024  16:30               600 funkcje_w_pythonie.py
28.05.2024  09:40               191 hello_world.py
28.05.2024  11:15             1˙782 instrukcje_warunkowe.py
28.05.2024  16:37               645 json_example.py
29.05.2024  09:54             1˙360 kantor.py
29.05.2024  11:52                92 klasa.csv
28.05.2024  14:12             2˙103 kolekcje_wbudowane_w_pythona.py
29.05.2024  10:39                 6 localfile.txt
28.05.2024  14:30               433 petle_w_pythonie.py
28.05.2024  15:07               420 pliki_csv.py
29.05.2024  10:44               421 praca_z_paramiko.py
28.05.2024  14:47               505 praca_z_plikami.py
29.05.2024  11:11    <DIR>          projekt1
29.05.2024  11:12    <DIR>          projekt2
28.05.2024  15:42             1˙186 proste_przetwarzanie.py
29.05.2024  11:50            18˙403 PrzetwarzanieDanych.ipynb
29.05.2024  11:08                35 requirements.txt
29.05.2024  10:29               969 system_plikow_w_pythonie.py
28.05.2024  10:27             1˙705 typy_zmiennych.py
29.05.2024  09:31               196 uzycie_kalkulatora.py
29.05.2024  09:31                25 waluty_do_kupienia.csv
29.05.2024  10:06               613 wyrazenia_regularne.py
28.05.2024  16:46                30 xxxx.json
28.05.2024  14:47                30 xxxx.txt
28.05.2024  14:54               762 zadanie_1.py
28.05.2024  16:30               661 zadanie_2.py
29.05.2024  11:20                29 zaleznosci.py
29.05.2024  09:27    <DIR>          __pycache__
              29 File(s)         34˙177 bytes
               8 Dir(s)   9˙864˙994˙816 bytes free

In [43]:
# %load klasa.csv
name,age,city
Ola,28,Warszawa
Łukasz,32,Warszawa
Kamil,27,Wrocław
Rafał,40,Warszawa

In [45]:
!pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.2-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-1.1.0-py3-none-any.whl.metadata (1.8 kB)
Downloading openpyxl-3.1.2-py2.py3-none-any.whl (249 kB)
   ---------------------------------------- 0.0/250.0 kB ? eta -:--:--
   - -------------------------------------- 10.2/250.0 kB ? eta -:--:--
   - -------------------------------------- 10.2/250.0 kB ? eta -:--:--
   ------ -------------------------------- 41.0/250.0 kB 326.8 kB/s eta 0:00:01
   ----------- --------------------------- 71.7/250.0 kB 438.9 kB/s eta 0:00:01
   -------------------------- ----------- 174.1/250.0 kB 876.1 kB/s eta 0:00:01
   ---------------------------------------- 250.0/250.0 kB 1.0 MB/s eta 0:00:00
Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.2

In [46]:
df.to_excel("klasa.xlsx", index=False)

In [47]:
df.to_json("klasa.json", index=False)

In [49]:
# pip install sqlalchemy

In [50]:
from sqlalchemy import create_engine

In [51]:
engine = create_engine("sqlite:///example.db")
df.to_sql("klasa", engine, index=False, if_exists="replace")

4

In [52]:
df.to_html("klasa.html", index=False)

In [54]:
# df.to_xml("klasa.html", index=False)

In [55]:
pd.read_excel("klasa.xlsx")

     name  age      city
0     Ola   28  Warszawa
1  Łukasz   32  Warszawa
2   Kamil   27   Wrocław
3   Rafał   40  Warszawa

In [56]:
pd.read_sql("klasa", engine)

     name  age      city
0     Ola   28  Warszawa
1  Łukasz   32  Warszawa
2   Kamil   27   Wrocław
3   Rafał   40  Warszawa

In [58]:
pd.read_csv("klasa.csv")

     name  age      city
0     Ola   28  Warszawa
1  Łukasz   32  Warszawa
2   Kamil   27   Wrocław
3   Rafał   40  Warszawa

In [59]:
dir(pd)

['ArrowDtype',
 'BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Flags',
 'Float32Dtype',
 'Float64Dtype',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt8Dtype',
 '__all__',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_built_with_meson',
 '_config',
 '_is_numpy_dev',
 '_libs',
 '_pandas_datetime_CAPI',
 '_pandas_parser_CAPI',
 '_testing',
 '_typing',
 '_version_meson',
 'annotations',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'from_dummies',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'read_xml',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [ ]:
1. utworz df ktory zawierac bedzie kolumny: marka, model
2. wyeksportuj go do excela (bez indeksu)
3. wczytaj go do inngo df